layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  transform_param {
    scale: 0.00392156862745
  }
  data_param {
    source: "/home/share/shaofan/lfw_caffe/lmdb/bin_test"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "pic1"
  type: "Slice"
  bottom: "data"
  top: "pic1"
  top: "pic2"
  slice_param {
    slice_dim: 1
    slice_point: 3
  }
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "pic1"
  top: "conv1"
  convolution_param {
    num_output: 10
    kernel_size: 10
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pic2"
  top: "conv2"
  convolution_param {
    num_output: 10
    kernel_size: 10
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "diff"
  type: "Eltwise"
  bottom: "pool1"
  bottom: "pool2"
  top: "diff"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: -1
  }
}
layer {
  name: "fc"
  type: "InnerProduct"
  bottom: "diff"
  top: "fc"
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "xavier"
    }
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc"
  bottom: "label"
  top: "loss"
}
